{"description":"<p><strong>Solicitation Number: </strong></p>\n\n<p>___________________</p>\n\n<p><strong>Notice Type: &nbsp;</strong>Special Notice</p>\n\n<p><strong>Synopsis: &nbsp;</strong></p>\n\n<p>The US Army Contracting Command-Redstone on behalf of Program Executive Office, Aviation, Logistics, Black Hawk Exchange and Sales Team (BEST) Program (In Accordance With (IAW) AR 725-1 Para 7-3 c. and 41 CFR 101-45.304-12) hereby notifies the Federal Agencies known to use the below aircraft, State Agencies for Surplus Property (SASP), the Senate, the House of Representatives, the Architect of the Capitol and any activities under the Architect&#39;s direction, the District of Columbia, and mixed ownership Government corporations that the following property is available for sale through negotiation at fixed prices. &nbsp;A reasonable period of time not to exceed 15 days shall be given the SASPs to indicate its desire to purchase the item and arrange satisfactory arrangements for payment, pickup, handling, and transportation charges. &nbsp;However, when more than one SASP agency has indicated interest in the item, the sale will be on a &#39;&#39;first-come, first-served&#39;&#39; basis. &nbsp;Satisfactory arrangements must be made with State agencies for payment, pickup, handling, and transportation charges, when necessary. &nbsp;Payment must be made within 30 calendar days after purchase. &nbsp;If payment is not made within this timeframe, simple interest may be charged at the rate which has been established by the Secretary of the Treasury as provided in section 12 of the Contract Disputes Act of 1978 (Pub. L. 95-563), from the date of first written demand until paid.<br />\n<br />\nItem Information:&nbsp; AIRCRAFT, UH-60A BLACK HAWK tail numbers:&nbsp;</p>\n\n<p>79-23282</p>\n\n<p></p>\n\n<p>Location: &nbsp;BEST Aircraft Consolidation Facility, SES-I West Facility, 248 Dunlop Blvd, Huntsville, AL &nbsp;35824<br />\n&nbsp;</p>\n\n<p>AIRCRAFT, 1 EACH:&nbsp; SIKORSKY UH-60A BLACK HAWK MEDIUM LIFT UTILITY HELICOPTER:&nbsp; S/N:</p>\n\n<p>79-23282</p>\n\n<p></p>\n\n<p>PLEASE CONTACT BEST CUSTODIAN FOR SPECIFIC ITEM DESCRIPTION AND DETAILED HISTORICAL AND MAINTENANCE RECORDS. &nbsp;PHOTOGRAPH IS SAMPLE REPRESENTATIVE OF THE AIRCRAFT. &nbsp;THE CONDITION OF THE PROPERTY IS &rdquo;AS IS&rdquo; CONDITION. &nbsp;PHYSICAL INSPECTION OF THE RECORDS AND AIRCRAFT IS STRONGLY RECOMMENDED AS AIRCRAFT CONDITION/RECORDS SUBJECT TO CHANGE PRIOR TO SALE. &nbsp;ALL SALES ARE FINAL AND NO WARRANTY IS IMPLIED OR APPLIED. &nbsp;AIRCRAFT MAY NOT BE IN COMPLIANCE WITH APPLICABLE FAA REQUIREMENTS. &nbsp;RECEIVING AGENCY IS SOLELY RESPONSIBLE FOR OBTAINING END USE CERTIFICATES AND BRINGING THE AIRCRAFT INTO COMPLIANCE WITH 14 CFR CHAPTER 1, OR OTHER APPLICABLE STANDARDS, BY OBTAINING ALL NECESSARY FAA INSPECTIONS OR MODIFICATIONS.<br />\n<br />\nAdditional Documents:&nbsp;<br />\nSAMPLE PHOTOGRAPH<br />\n<br />\nSPECIAL INSPECTION INFORMATION:&nbsp; &nbsp;<br />\nInspection by appointment only. &nbsp;Please contact the custodian for inspection dates and times and for removal arrangements.<br />\n<br />\nPROPERTY INSPECTION/REMOVAL:&nbsp; Due to security issues at property location, interested party validated representatives are required to contact the custodian prior to entering the facility to inspect/remove property, and at times, they are not permitted to use phones.&nbsp; Therefore, successful receiving parties must communicate with the custodian in advance to make arrangements for inspection/removal and/or have a cell phone with them to contact them once they arrive at the secured location.&nbsp; Cameras are prohibited at the property location unless specifically coordinated with and approved by the custodian.&nbsp; Successful receiving parties are cautioned that they will be responsible for coordination and any expenses incurred with personnel, clearances, inspection, maintenance, loading, packing, movement and removal of the H-60A aircraft from the exact place on the property.&nbsp; All maintenance actions performed after the official transfer of ownership and any maintenance associated with the movement of the aircraft will be coordinated between the receiving party and SES-I.&nbsp; Successful receiving parties will have 30 days after official transfer of ownership to remove all property.&nbsp; The Government shall not be liable for personal injuries to, disabilities of, or death of any persons arising from or incidental to the inspection, purchase, removal, use or disposition of this aircraft.&nbsp; Receiving parties shall hold the Government harmless from any or all debts, liabilities, judgments, costs, demands, suits, actions, or claims of any nature arising from or incidental to inspection, purchase, use, or resale of this item.</p>\n\n<p><br />\n&nbsp;</p>\n\n<p></p>\n\n<p></p>\n\n<p>Property Location and inquiries/questions regarding property inspection and/or removal:<br />\n<br />\nMatthew Gallegos<br />\nBEST Custodian<br />\nUtility Helicopters Project Office<br />\nSparkman Complex, Building 5308, Room 8132 Redstone Arsenal, AL&nbsp; 35898<br />\nOffice 256-842-0912 or Cell 256-763-3650<br />\nEMAIL:&nbsp; matthew.a.gallegos.civ@mail.mil</p>\n\n<p><br />\nFor inquiries/questions regarding payment, or contractual issues, contact the following sales office:<br />\n<br />\nKim Ledbetter<br />\nPEO Aviation, Logistics<br />\nBEST Business Office<br />\nWood Road, Redstone Arsenal, AL&nbsp; 35898<br />\nOffice 256-876-1587<br />\nEMAIL kimberly.g.ledbetter.ctr@mail.mil<br />\n<br />\nTHE ANNOUNCEMENT CLOSES SEPTEMBER 14, 2020.</p>\n\n<p><strong>Additional Info: &nbsp;</strong></p>\n\n<p><u>Additional documentation</u><br />\n<strong>Contracting Office Address: &nbsp;</strong><br />\nACC-RSA - (Aviation), ATTN: &nbsp;CCAM, Building 5303, Martin Road, Redstone Arsenal, AL &nbsp;35898-5280<br />\n<strong>Point of Contact(s): &nbsp;</strong><br />\nBecky Snyder, 256-497-7340<br />\n<u>ACC-RSA - (Aviation)</u></p>\n"}